{
  "slug": "endometrial-cancer",
  "title": "Understanding Endometrial Cancer",
  "subtitle": "What it is, why it's done, and what to expect",
  "tag": "Medical Education",
  "sections": [
    {
      "id": 1,
      "buttonLabel": "Overview",
      "buttonIcon": "Info",
      "cardTitle": "Endometrial Cancer Overview",
      "layout": "two-column",
      "content": [
        {
          "type": "heading",
          "text": "What Is Endometriosis?"
        },
        {
          "type": "text",
          "value": "Endometriosis is a condition where tissue similar to the lining of the uterus (the endometrium) grows outside the uterus."
        },
        {
          "type": "heading",
          "text": "This tissue can affect:",
          "level": 4
        },
        {
          "type": "bulletList",
          "items": [
            "Ovaries",
            "Fallopian tubes",
            "The pelvic lining",
            "Rarely, other organs"
          ]
        },
        {
          "type": "heading",
          "text": "It can lead to:",
          "level": 4
        },
        {
          "type": "bulletList",
          "items": ["Inflammation", "Pain", "Scarring and adhesions"]
        },
        {
          "type": "infoBox",
          "title": "Important",
          "description": "Endometriosis is a non-cancerous condition, but it can cause significant pain and may affect fertility."
        },
        {
          "type": "image",
          "src": "/Endometrial.png",
          "alt": "Endometrial cancer illustration"
        }
      ]
    },
    {
      "id": 2,
      "buttonLabel": "How It Starts",
      "buttonIcon": "Activity",
      "cardTitle": "What Causes Endometriosis?",
      "layout": "single-column",
      "content": [
        {
          "type": "text",
          "value": "The exact cause of endometriosis is not fully understood. Several factors are thought to play a role:"
        },

        {
          "type": "grid",
          "columns": 2,
          "items": [
            {
              "title": "Retrograde (backward) menstruation",
              "description": "Menstrual blood flows back through the fallopian tubes into the pelvis"
            },
            {
              "title": "Genetic factors",
              "description": "Endometriosis can run in families"
            },
            {
              "title": "Immune system differences",
              "description": "The body may not clear misplaced endometrial-like cells effectively"
            },
            {
              "title": "Hormonal influences",
              "description": "Endometriosis tissue responds to hormones such as oestrogen"
            }
          ]
        },
        {
          "type": "infoBox",
          "title": "Did You Know?",
          "description": "Endometriosis is likely caused by a combination of these factors rather than a single cause.",
          "icon": "Lightbulb"
        }
      ]
    },
    {
      "id": 3,
      "buttonLabel": "Impact on Fertility and Wellbeing",
      "buttonIcon": "AlertTriangle",
      "cardTitle": "Impact on Fertility and Wellbeing",
      "layout": "single-column",
      "content": [
        {
          "type": "text",
          "value": "Endometriosis can affect different aspects of life. Understanding its impact can help guide treatment and support."
        },

        {
          "type": "infoBox",
          "title": "Fertility Impact",
          "description": "Endometriosis can make it more difficult to become pregnant, particularly in moderate to severe cases. However, many people with endometriosis do conceive, either naturally or with medical support. Early assessment and appropriate treatment may help preserve fertility options.",
          "icon": "ShieldCheck"
        },
        {
          "type": "infoBox",
          "title": "Emotional Wellbeing",
          "description": "Living with chronic pain and fertility concerns can affect emotional wellbeing and quality of life. Seeking medical advice, pain management, and emotional support can help manage both physical and psychological effects.",
          "icon": "ShieldCheck"
        }
      ]
    },
    {
      "id": 4,
      "buttonLabel": "Recognising Symptoms",
      "buttonIcon": "Eye",
      "cardTitle": "Symptoms of Endometrial Cancer",
      "layout": "single-column",
      "content": [
        {
          "type": "text",
          "value": "Endometriosis can cause a range of symptoms, which often worsen around your period."
        },

        {
          "type": "bulletList",
          "items": [
            "Painful periods – cramps that are severe, long-lasting, or worsening over time",
            "Pelvic pain – pain between periods or chronic pelvic discomfort",
            "Pain during or after sex",
            "Pain when urinating – especially during menstruation",
            "Pain during bowel movements – often worse during periods",
            "Fertility problems – difficulty becoming pregnant"
          ]
        },
        {
          "type": "infoBox",
          "title": "Important",
          "description": "Period pain is common, but severe pain that interferes with daily life is not typical. If you have ongoing or worsening symptoms, seek medical advice. Early assessment can help manage symptoms and reduce the impact on your quality of life.",
          "icon": "AlertTriangle"
        }
      ]
    },
    {
      "id": 5,
      "buttonLabel": "Getting Diagnosed",
      "buttonIcon": "ScanSearch",
      "cardTitle": "Diagnosis of Endometrial Cancer",
      "layout": "single-column",
      "content": [
        {
          "type": "heading",
          "text": "How It's Diagnosed"
        },
        {
          "type": "text",
          "value": "Endometriosis can be difficult to diagnose because symptoms may overlap with other conditions."
        },
        {
          "type": "grid",
          "columns": 3,
          "items": [
            {
              "title": "1. Pelvic Examination",
              "description": "A pelvic exam may be done, but findings can be normal. It may help identify tenderness, nodules, or ovarian cysts."
            },
            {
              "title": "2. Imaging Tests",
              "description": "Ultrasound (often transvaginal) or MRI can help detect ovarian endometriosis (endometriomas) or deep disease, but scans may not detect all types of endometriosis."
            },
            {
              "title": "3. Laparoscopy",
              "description": "A keyhole surgical procedure that allows doctors to look inside the pelvis. This can confirm the diagnosis and allow treatment or biopsy at the same time. It is usually considered when symptoms are significant or imaging is unclear."
            }
          ]
        }
      ]
    },
    {
      "id": 6,
      "buttonLabel": "Treatment Options",
      "buttonIcon": "Syringe",
      "cardTitle": "Treatment Options",
      "layout": "single-column",
      "content": [
        {
          "type": "text",
          "value": "Treatment is tailored to your symptoms, severity of disease, and future fertility plans."
        },

        {
          "type": "grid",
          "columns": 2,
          "items": [
            {
              "title": "Pain Relief Medication",
              "description": "Painkillers such as paracetamol or anti-inflammatory medicines (e.g., ibuprofen) are often used to help manage pain. These treat symptoms but do not treat the underlying condition."
            },
            {
              "title": "Hormone Therapy",
              "description": "Hormonal treatments can reduce or suppress endometriosis activity. Options may include combined hormonal contraceptives, progestogen-only treatments, or GnRH analogues. These aim to control symptoms rather than cure the condition."
            },
            {
              "title": "Conservative Surgery",
              "description": "Keyhole (laparoscopic) surgery may be offered to remove or destroy endometriosis tissue while preserving the uterus and ovaries. Surgery can improve pain and may help fertility in some cases, though symptoms can return."
            },
            {
              "title": "Hysterectomy",
              "description": "Removal of the uterus may be considered for severe symptoms when other treatments have not worked and pregnancy is not desired. It is not a guaranteed cure, especially if endometriosis is present outside the uterus."
            }
          ]
        },
        {
          "type": "infoBox",
          "title": "Key Point",
          "description": "Treatment focuses on long-term symptom control and improving quality of life. Decisions are made together based on your symptoms, response to previous treatments, and personal goals.",
          "icon": "Heart"
        }
      ]
    }
  ]
}
